1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанных/Forms/ВыполнениеДействийСПакетами/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивВыделенныхСтрок = Параметры.МассивВыделенныхСтрок;
	Для каждого КлючСтроки Из МассивВыделенныхСтрок Цикл
		СписокИдентификаторовПакетов.Добавить(КлючСтроки.ИдентификаторПакета);
	КонецЦикла;
	
	ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " ("+СписокИдентификаторовПакетов.Количество()+" шт.)";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИзменитьСостояниеПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпособОбработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСледующейобработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКоличествоПопытокОбработкиПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПакетПрипаркованПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПакетыПриИзменении(Элемент)
	ОбновитьДоступностьРеквизитов();
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиКомандФормы

// ТУДУ - поведение этой формы  = поведение формы многопоточного изменеия. Т.е. этот же вопрос задаем в том же виде переда нарезкой пакетов!
&НаКлиенте
Процедура ВыполнитьДействия(Команда)
	
	Если Не УдалитьПакеты И Не ИзменитьСостояние И Не ИзменитьСпособОбработки И Не ИзменитьПакетПрипаркован И
		Не ИзменитьКоличествоПопытокОбработки И Не ИзменитьДатуСледующейОбработки Тогда
		ПоказатьПредупреждение(, "Не выбрано действие с пакетами!", , "Не выбрано действие");
		Возврат;
	КонецЕсли;

	Если НЕ УдалитьПакеты и ИзменитьСостояние и Не ЗначениеЗаполнено(Состояние) Тогда
		ПоказатьПредупреждение(, "Не заполнено новое состояние пакетов данных!", , "Не заполнены реквизиты");
		Возврат;
	КонецЕсли;
	
	Если НЕ УдалитьПакеты и ИзменитьСпособОбработки и Не ЗначениеЗаполнено(СпособОбработки) Тогда
		ПоказатьПредупреждение(, "Не заполнен новый способ оюбработки пакетов!", , "Не заполнены реквизиты");
		Возврат;
	КонецЕсли;
	
	ДействияВыбраны = Ложь; 
	ТестДиалогаПодтверждения = "Выполнить действия:";
	Если УдалитьПакеты Тогда
		ДействияВыбраны = Истина;
		ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Удалить пакеты " + """";
	Иначе
		Если ИзменитьСостояние Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить состояние - """ + Состояние + """";
		КонецЕсли;
		Если ИзменитьСпособОбработки Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить способ обработки - """ + СпособОбработки + """";
		КонецЕсли;
		Если ИзменитьКоличествоПопытокОбработки Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить Количество попыток обработки - " + КоличествоПопытокОбработки;
		КонецЕсли;
		Если ИзменитьДатуСледующейобработки Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить дату следующей обработки - " + ДатаСледующейОбработки;
		КонецЕсли;
		Если ИзменитьПакетПрипаркован Тогда
			ДействияВыбраны = Истина;
			ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + Символы.ПС + " - Изменить пакет припаркован - """ + ПакетПрипаркован + """";
		КонецЕсли;
	КонецЕсли;
	ТестДиалогаПодтверждения = ТестДиалогаПодтверждения + "?";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПодтвержденияДействия", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТестДиалогаПодтверждения ,РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДоступностьРеквизитов()
	
	Элементы.ИзменитьСостояние.Доступность					= НЕ УдалитьПакеты;
	Элементы.ИзменитьСпособОбработки.Доступность 			= НЕ УдалитьПакеты;
	Элементы.ИзменитьДатуСледующейОбработки.Доступность 	= НЕ УдалитьПакеты;
	Элементы.ИзменитьКоличествоПопытокОбработки.Доступность	= НЕ УдалитьПакеты;
	Элементы.ИзменитьПакетПрипаркован.Доступность 			= НЕ УдалитьПакеты;
	
	Элементы.Состояние.Доступность			 		= ИзменитьСостояние и НЕ УдалитьПакеты;
	Элементы.СпособОбработки.Доступность 			= ИзменитьСпособОбработки и НЕ УдалитьПакеты;     
	Элементы.ДатаСледующейОбработки.Доступность 	= ИзменитьДатуСледующейОбработки и НЕ УдалитьПакеты;
	Элементы.КоличествоПопытокОбработки.Доступность = ИзменитьКоличествоПопытокОбработки и НЕ УдалитьПакеты;
	Элементы.ПакетПрипаркован.Доступность 			= ИзменитьПакетПрипаркован и НЕ УдалитьПакеты;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодтвержденияДействия(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если УдалитьПакеты Тогда
			ОписаниеДействий = Новый Структура("УдалитьПакеты", Истина);
		Иначе
			ОписаниеДействий = Новый Структура;
			
			ОписаниеДействий.Вставить("ИзменитьСостояние"	, ИзменитьСостояние);
			ОписаниеДействий.Вставить("Состояние"			, Состояние);
			
			ОписаниеДействий.Вставить("ИзменитьСпособОбработки"	, ИзменитьСпособОбработки);
			ОписаниеДействий.Вставить("СпособОбработки"			, СпособОбработки);
			
			ОписаниеДействий.Вставить("ИзменитьКоличествоПопытокОбработки"	, ИзменитьКоличествоПопытокОбработки);
			ОписаниеДействий.Вставить("КоличествоПопытокОбработки"			, КоличествоПопытокОбработки);
			
			ОписаниеДействий.Вставить("ИзменитьДатуСледующейобработки"	, ИзменитьДатуСледующейобработки);
			ОписаниеДействий.Вставить("ДатаСледующейОбработки"			, ДатаСледующейОбработки);
			
			ОписаниеДействий.Вставить("ИзменитьПакетПрипаркован"	, ИзменитьПакетПрипаркован);
			ОписаниеДействий.Вставить("ПакетПрипаркован"			, ПакетПрипаркован);
			
		КонецЕсли;
		
		Результат = ИзмененитьПакетыДанных(ОписаниеДействий);
		Если НЕ Результат.Ошибка Тогда
			
			ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ум_ПакетыДанных"));
			ЭтаФорма.Закрыть();
			
		Иначе
			
			ПоказатьПредупреждение(,"Ошибка выполения действий с пакетами!" + Символы.ПС + Результат.ОписаниеОшибки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзмененитьПакетыДанных(ОписаниеДействий)
	МассивИДПакетов = СписокИдентификаторовПакетов.ВыгрузитьЗначения();
	Результат = ум_ИзменениеПакетовДанных.ИзмененитьПакетыДанных(ОписаниеДействий, МассивИДПакетов);
	Возврат Результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
